[
"Janganlah engkau mengucapkan perkataan yang engkau sendiri tak suka mendengarnya jika orang lain mengucapkannya kepadamu.",
"Jangan berhenti berdoa untuk yang terbaik bagi orang yang kau cintai.",
"Aku sudah pernah merasakan semua kepahitan dalam hidup dan yang paling pahit ialah berharap kepada manusia.",
"Balas dendam terbaik adalah menjadikan dirimu lebih baik.",
"Kemarahan dimulai dengan kegilaan dan berakhir dengan penyesalan.",
"Bila kau merasa cemas dan gelisah akan sesuatu, masuklah ke dalamnya sebab ketakutan menghadapinya lebih mengganggu daripada sesuatu yang kau takuti sendiri.",
"Tubuh dibersihkan dengan air. Jiwa dibersihkan dengan air mata. Akal dibersihkan dengan pengetahuan. Dan jiwa dibersihkan dengan cinta.",
"Telanlah amarahmu sebab kau tidak pernah menemukan minuman yang dapat meninggalkan rasa lebih manis dan lebih lezat daripada itu.",
"Jangan membenci siapapun, tidak peduli berapa banyak mereka bersalah padamu.",
"Orang yang terlalu memikirkan akibat dari sesuatu keputusan atau tindakan, sampai kapan pun dia tidak akan menjadi orang berani.",
"Sebagian obat justru menjadi penyebab datangnya penyakit, sebagaimana sesuatu yang menyakitkan adakalanya menjadi obat penyembuh.",
"Ketulusan seseorang sesuai dengan kadar kemanusiaannya.",
"Sisihkan gelombang-gelombang kerisauan dengan kekuatan kesabaran dan keyakinan.",
"Memaafkan adalah kemenangan terbaik.",
"Kesucian hati nurani seseorang sesuai dengan kadar kepekaannya terhadap kehormatan dirinya.",
"Memuji seseorang lebih daripada yang ia berhak menerimanya sama saja menjilatnya. Tetapi melalaikan pujian bagi orang yang berhak menerimanya menunjukkan kebodohan dan kedengkian.",
"Selemah-lemah manusia ialah orang yang tak mau mencari sahabat dan orang yang lebih lemah dari itu ialah orang yang menyia-nyiakan sahabat yang telah dicari.",
"Siapa yang memandang dirinya buruk, maka dia adalah orang yang baik. Dan siapa yang memandang dirinya baik, dia adalah orang yang buruk.",
"Bila sikap lemah lembut hanya mengakibatkan timbulnya kekerasan maka kekerasan adalah suatu bentuk kelembutan hati.",
"Apabila sesuatu yang kau senangi tidak terjadi maka senangilah apa yang terjadi.",
"Hati manusia adalah seperti binatang buas. Barangsiapa hendak menjinakkannya, akan diterkamnya.",
"Jika ada kata-kata yang melukai hati, menunduklah dan biarkan ia melewatimu. (jangan dimasukkan hati agar tidak lelah hatimu).",
"Kecemburuan seorang wanita adalah kekufuran. Sedangkan di sisi lain, kecemburuan seorang pria justru merupakan sebuah bentuk keimanan.",
"Ketika telah berhasil mengalahkan musuh, kita jadikan sifat pemaaf sebagai bentuk rasa syukur atas kemenangan yang telah kita dapatkan.",
"Ketika seorang wanita menangis karena disakiti pria, maka malaikat akan mengutuknya.",
"Aku tidak sebaik yang kau katakan, dan Aku tidak seburuk apa yang terlintas dihatimu."
",Ketahuilah bahwa sabar, jika dipandang dalam permasalahan seseorang adalah ibarat kepala dari suatu tubuh. Jika kepalanya hilang maka keseluruhan tubuh itu akan membusuk. Sama halnya, jika kesabaran hilang, maka seluruh permasalahan akan rusak.",
"Barang siapa menyalakan api fitnah, maka dia sendiri yang akan menjadi bahan bakarnya.",
"Orang yang suka berkata jujur mendapatkan tiga hal: kepercayaan, cinta dan rasa hormat.",
"Kenali kebenaran, maka kamu akan tahu orang-orang yang benar. Benar tidak diukur oleh orang-orangnya, tetapi manusia diukur oleh kebenaran.",
"Jangan pernah membuat keputusan dalam kemarahan dan jangan pernah membuat janji dalam kebahagiaan.",
"Kezaliman akan terus ada, bukan karena banyaknya orang-orang jahat. Tapi, karena diamnya orang-orang baik.",
"Jangan menganggap diamnya seseorang sebagai sikap sombongnya, bisa jadi dia sedang sibuk bertengkar dengan dirinya sendiri.",
"Bila sikap lemah lembut hanya mengakibatkan timbulnya kekerasan maka kekerasan adalah suatu bentuk kelembutan hati.",
"Berbahagialah orang yang dapat menjadi tuan bagi dirinya, menjadi pemandu untuk nafsunya, dan menjadi kapten untuk bahtera hidupnya.",
"Jangan katakan kepada Allah ‘Aku punya masalah besar’ tetapi katakanah kepada masalah ‘Aku punya Allah yang maha besar’.",
"Tidak sepatutnya seseorang merasa aman tentang dua hal: kesehatan dan kekayaan.",
"Nilai seseorang sesuai dengan kadar tekadnya.",
"Pergunjingan adalah puncak kemampuan orang-orang yang lemah.",
"Jangan sekali-kali merasa malu memberi walaupun sedikit, sebab tidak memberi sama sekali pasti lebih sedikit nilainya.",
"Jadilah orang yang dermawan tapi jangan menjadi pemboros. Jadilah orang yang hidup sederhana, tetapi jangan menjadi orang yang kikir.",
"Selama kedudukan Anda baik, kekurangan Anda tertutup.",
"Takutlah kamu akan perbuatan dosa di saat sendirian, di saat inilah saksimu adalah juga hakimmu.",
"Orang yang hanya berfikir bagi kepentingan perutnya saja, maka harga dirinya serupa dengan apa yang keluar dari isi perutnya.",
"Setiap nafas seseorang adalah sebuah langkah menuju ajalnya.",
"Ucapan sahabat yang jujur lebih besar harganya daripada harta benda yang diwarisi nenek moyang.",
"Barangsiapa menyalakan api fitnah, maka dia sendiri yang akan menjadi bahan bakarnya.",
"Menjaga air muka adalah hiasan bagi orang miskin, sebagaimana syukur adalah hiasan bagi orang kaya.",
"Berpikirlah positif, tidak peduli seberapa keras kehidupanmu.",
"Kesabaran itu ada dua macam: sabar atas sesuatu yang tidak kau ingin dan sabar menahan diri dari sesuatu yang kau ingini.",
"Jangan menjelaskan tentang dirimu kepada siapapun, karena yang menyukaimu tidak butuh itu. Dan yang membencimu tidak percaya itu.",
"Jangan kenali kebenaran berdasarkan individu-individu. Kenalilah kebenaran itu sendiri, otomatis kau akan kenal siapa di pihak yang benar.",
"Dia yang menaruh kepercayaan pada dunia, maka dunia akan mengkhianatinya.",
"Takwa adalah takut kepada Allah, melaksanakan segala sesuatu yang datang dari-Nya, ridha dengan karunia-Nya walaupun sedikit, dan menyiapkan diri untuk menyambut kematian.",
"Tiga macam orang yang tidak diketahui kecuali dalam tiga situasi: Tidak diketahui orang pemberani kecuali dalam situasi perang; Tidak diketahui orang yang penyabar kecuali ketika sedang marah; Tidak diketahui sebagai teman kecuali ketika temannya sedang butuh.",
"Kita perlu terus menerus mengingat tiga hal, yaitu kematian, amal perbuatan, dan kehidupan setelah mati",
"Lidah orang yang berakal berada di belakang hatinya, sedangkan hati orang bodoh berada di belakang lidahnya.",
"Angin tidak berhembus untuk menggoyangkan pepohonan, melainkan menguji kekuatan akarnya.",
"Jangan gunakan ketajaman kata-katamu pada ibumu yang mengajarimu cara berbicara.",
"Orang yang berdoa tanpa beramal sama halnya seperti pemanah tanpa busur.",
"Kesempatan datang bagai awan berlalu. Pergunakanlah ketika ia nampak di hadapanmu.",
"Harta itu kurang apabila dibelanjakan tapi ilmu bertambah bila dibelanjakan.",
"Hiburlah hatimu, siramilah ia dengan percikan hikmah. Seperti halnya fisik, hati juga merasakan letih.",
"Sesungguhnya mengikuti hawa nafsu dapat menghalanginya dari kebenaran dan panjang angan-angan dapat membuatnya lupa akhirat.",
"Sifat pemarah adalah musuh utama akal.",
"Ikatlah ilmu dengan menulis.",
"Manusia adalah musuh bagi apa yang tidak dia ketahui.",
"Tanda-tanda orang nan celaka antara lain: bergairah dalam mengerjakan perbuatan-perbuatan haram dan menjauhi nasihat.",
"Ilmu itu lebih baik daripada harta. Ilmu menjaga engkau dan engkau menjaga harta. Ilmu itu penghukum dan harta terhukum. Harta itu kurang apabila dibelanjakan, tapi ilmu bertambah bila dibelanjakan.",
"Hiburlah hatimu, siramilah ia dengan percikan hikmah. Seperti halnya fisik, hati juga merasakan letih.",
"Dua jenis manusia yang tak akan merasa kenyang selama-lamanya: pencari ilmu dan pencari harta.",
"Ilmu tanpa akal ibarat seperti memiliki sepatu tanpa kaki. Dan akal tanpa ilmu ibarat seperti memiliki kaki tanpa sepatu.",
"Apabila akal tidak sempurna maka kurangilah berbicara.",
"Ketika ahlul haq (orang yang memiliki ilmu) diam atas suatu kebatilan, maka mereka (pelaku kebatilan) akan menyangka bahwa mereka berada dalam kebenaran.",
"Diam sampai engkau diminta untuk berbicara, lebih baik daripada kau terus berbicara sampai diminta untuk diam.",
"Tiada kekayaan yang lebih utama daripada akal. Tiada keadaan lebih menyedihkan daripada kebodohan. Tiada warisan yang lebih baik daripada pendidikan. Dan tiada pembantu yang lebih baik daripada musyawarah.",
"Tubuh dibersihkan dengan air. Jiwa dibersihkan dengan air mata. Akal dibersihkan dengan pengetahuan. Dan jiwa dibersihkan dengan cinta.",
"Orang pesimis selalu melihat kesulitan dalam setiap kesematan, tapi orang optimis selalu melihat kesempatan dalam setiap kesulitan.",
]